In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
import matplotlib.pyplot as plt

In [2]:
d=pd.read_csv('datasets\deliveries.csv')
m=pd.read_csv('datasets\matches.csv')

In [3]:
c=m.columns
m1=m.drop(c[[2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]],axis=1)
m1.head()

   id  season
0   1    2017
1   2    2017
2   3    2017
3   4    2017
4   5    2017

In [9]:
b1=pd.read_csv('bowl_ecos.csv')
b1.head()

   match_id       bowler  over  total_runs
0         1  A Choudhary     2          16
1         1  A Choudhary    10           4
2         1  A Choudhary    13          18
3         1  A Choudhary    18          17
4         1      A Nehra     1          11

In [10]:
b2=b1.rename(columns={'match_id':'id'})

In [12]:
new=pd.merge(m1,b2,on='id')
new.to_csv('yashfile.csv')